org/2014-05-04-sed-awk.org
#+STARTUP: showall indent
#+STARTUP: hidestars
#+OPTIONS:   H:2 num:nil toc:nil \n:nil ::t |:t -:t f:t *:t <:t
#+OPTIONS:   tex:t  d:nil todo:t pri:nil tags:not-in-toc
#+BEGIN_HTML
---
category: computer science and enginneering
layout: post
title: "sed and awk: Always feel not enough"
tags: [linux,"shell",sed, awk]
---
{% include JB/setup %}

#+END_HTML
* sed 删除某一行
#+BEGIN_SRC bash
sed '4d' filename
#+END_SRC
删除filename的第4行

* sed 添加一行
#+BEGIN_SRC bash
sed '4a add something after line 4' filename
#+END_SRC
在filename的第4行后面添加一行，内容为: add somthing after line 4。

* 小任务1
在test目录下，找到某些文件，并在这个文件的某一固定行如61行，后面添加同
样的内容。
#+BEGIN_SRC sh
#!/bin/bash 
set -x
ff=$(find ./test -name "*.cc" | xargs grep "sensor_id\[4" | awk -F: '{print $1}' | uniq) 
#echo $ff
for i in $ff 
do
#    sed '4d' $i > $i.temp
   sed '61a DEBUG << \"sensor_id \" << sensor_id;' $i > $i.temp
   cp $i.temp $i
   rm -f $i.temp
done
#+END_SRC

* little task
In some directory which has many subdirectory, there are many c++
header files. You are asked to find all definitions of classes with
parent calss.

#+BEGIN_SRC sh
grep -r "class.*:.*public" --include \*.h | sed 's/:/\t:/g' | awk -F"\t" '{$1="";print $0}' | sed 's/^..//g'
#+END_SRC

Explaination: 
- find all classes, such as:
#+BEGIN_SRC sh
tool/optimizer/loadManager/LMStatisticsPool.h:class LMStatisticsPool:public map<StatisticsName, StatisticsMap>
#+END_SRC

- change ":" into "tab space :", its goal is to delete the content
  before the first ":".  the above example is changed into:

#+BEGIN_SRC sh
tool/optimizer/loadManager/LMStatisticsPool.h	:class LMStatisticsPool	:public map<StatisticsName, StatisticsMap>
#+END_SRC

- delete content before the first tab space:
#+BEGIN_SRC sh
:class LMStatisticsPool	:public map<StatisticsName, StatisticsMap>
#+END_SRC

- delete the colon before class
#+BEGIN_SRC sh
class LMStatisticsPool	:public map<StatisticsName, StatisticsMap>
#+END_SRC
