_posts/2014-05-04-sed-awk.html
---
category: computer science and enginneering
layout: post
title: "sed and awk: Always feel not enough"
tags: [linux,"shell",sed, awk]
---
{% include JB/setup %}
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">sed 删除某一行</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">

<pre class="src src-bash">sed '4d' filename
</pre>
</div>
<p>
删除filename的第4行
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">sed 添加一行</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">

<pre class="src src-bash">sed '4a add something after line 4' filename
</pre>
</div>
<p>
在filename的第4行后面添加一行，内容为: add somthing after line 4。
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">小任务1</h2>
<div class="outline-text-2" id="text-3">
<p>
在test目录下，找到某些文件，并在这个文件的某一固定行如61行，后面添加同
样的内容。
</p>
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #969896; font-style: italic;">#</span><span style="color: #969896; font-style: italic;">!/bin/</span><span style="color: #b5bd68;">bash</span><span style="color: #969896; font-style: italic;"> </span>
<span style="color: #b294bb;">set</span> -x
<span style="color: #f0c674;">ff</span>=$(<span style="color: #b294bb;">find</span> ./test -name <span style="color: #8abeb7;">"*.cc"</span> | xargs grep <span style="color: #8abeb7;">"sensor_id\[4"</span> | awk -F: <span style="color: #8abeb7;">'{print $1}'</span> | uniq) 
<span style="color: #969896; font-style: italic;">#</span><span style="color: #969896; font-style: italic;">echo $ff</span>
<span style="color: #b5bd68;">for</span> i<span style="color: #b5bd68;"> in</span> $<span style="color: #f0c674;">ff</span> 
<span style="color: #b5bd68;">do</span>
<span style="color: #969896; font-style: italic;">#    </span><span style="color: #969896; font-style: italic;">sed '4d' $i &gt; $i.temp</span>
   sed <span style="color: #8abeb7;">'61a DEBUG &lt;&lt; \"sensor_id \" &lt;&lt; sensor_id;'</span> $<span style="color: #f0c674;">i</span> &gt; $<span style="color: #f0c674;">i</span>.temp
   cp $<span style="color: #f0c674;">i</span>.temp $<span style="color: #f0c674;">i</span>
   rm -f $<span style="color: #f0c674;">i</span>.temp
<span style="color: #b5bd68;">done</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">little task</h2>
<div class="outline-text-2" id="text-4">
<p>
In some directory which has many subdirectory, there are many c++
header files. You are asked to find all definitions of classes with
parent calss.
</p>

<div class="org-src-container">

<pre class="src src-sh">grep -r <span style="color: #8abeb7;">"class.*:.*public"</span> --include <span style="color: #8abeb7;">\*</span>.h | sed <span style="color: #8abeb7;">'s/:/\t:/g'</span> | awk -F<span style="color: #8abeb7;">"\t"</span> <span style="color: #8abeb7;">'{$1="";print $0}'</span> | sed <span style="color: #8abeb7;">'s/^..//g'</span>
</pre>
</div>

<p>
Explaination: 
</p>
<ul class="org-ul">
<li>find all classes, such as:
</li>
</ul>
<div class="org-src-container">

<pre class="src src-sh">tool/optimizer/loadManager/LMStatisticsPool.h:class LMStatisticsPool:public map&lt;StatisticsName, StatisticsMap&gt;
</pre>
</div>

<ul class="org-ul">
<li>change ":" into "tab space :", its goal is to delete the content
before the first ":".  the above example is changed into:
</li>
</ul>

<div class="org-src-container">

<pre class="src src-sh">tool/optimizer/loadManager/LMStatisticsPool.h   :class LMStatisticsPool :public map&lt;StatisticsName, StatisticsMap&gt;
</pre>
</div>

<ul class="org-ul">
<li>delete content before the first tab space:
</li>
</ul>
<div class="org-src-container">

<pre class="src src-sh">:class LMStatisticsPool :public map&lt;StatisticsName, StatisticsMap&gt;
</pre>
</div>

<ul class="org-ul">
<li>delete the colon before class
</li>
</ul>
<div class="org-src-container">

<pre class="src src-sh">class LMStatisticsPool  :public map&lt;StatisticsName, StatisticsMap&gt;
</pre>
</div>
</div>
</div>
